experiments/results/logs/burst-hpa-006/wrk2.txt
Running 2m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7662.796ms, rate sampling interval: 18300ms
  Thread calibration: mean lat.: 7628.062ms, rate sampling interval: 18300ms
  Thread calibration: mean lat.: 7837.532ms, rate sampling interval: 18399ms
  Thread calibration: mean lat.: 8233.123ms, rate sampling interval: 18907ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.98m    27.20s    1.71m    58.35%
    Req/Sec     3.09      0.29     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.99m 
 75.000%    1.38m 
 90.000%    1.59m 
 99.000%    1.70m 
 99.900%    1.71m 
 99.990%    1.72m 
 99.999%    1.72m 
100.000%    1.72m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10174.463     0.000000            2         1.00
   21364.735     0.100000          166         1.11
   31358.975     0.200000          332         1.25
   40075.263     0.300000          498         1.43
   50069.503     0.400000          664         1.67
   59146.239     0.500000          830         2.00
   63176.703     0.550000          913         2.22
   67698.687     0.600000          996         2.50
   73727.999     0.650000         1079         2.86
   78184.447     0.700000         1163         3.33
   83034.111     0.750000         1248         4.00
   84869.119     0.775000         1289         4.44
   87162.879     0.800000         1328         5.00
   89587.711     0.825000         1369         5.71
   91684.863     0.850000         1411         6.67
   93782.015     0.875000         1455         8.00
   94502.911     0.887500         1473         8.89
   95354.879     0.900000         1496        10.00
   96796.671     0.912500         1514        11.43
   98566.143     0.925000         1535        13.33
   99483.647     0.937500         1557        16.00
  100073.471     0.943750         1567        17.78
  100335.615     0.950000         1577        20.00
  100597.759     0.956250         1589        22.86
  100925.439     0.962500         1598        26.67
  101187.583     0.968750         1611        32.00
  101253.119     0.971875         1616        35.56
  101384.191     0.975000         1619        40.00
  101515.263     0.978125         1623        45.71
  101580.799     0.981250         1628        53.33
  101777.407     0.984375         1634        64.00
  101842.943     0.985938         1636        71.11
  101908.479     0.987500         1640        80.00
  101974.015     0.989062         1644        91.43
  101974.015     0.990625         1644       106.67
  102105.087     0.992188         1649       128.00
  102105.087     0.992969         1649       142.22
  102105.087     0.993750         1649       160.00
  102170.623     0.994531         1651       182.86
  102301.695     0.995313         1653       213.33
  102301.695     0.996094         1653       256.00
  102498.303     0.996484         1654       284.44
  102498.303     0.996875         1654       320.00
  102563.839     0.997266         1656       365.71
  102563.839     0.997656         1656       426.67
  102563.839     0.998047         1656       512.00
  102694.911     0.998242         1657       568.89
  102694.911     0.998437         1657       640.00
  102694.911     0.998633         1657       731.43
  102891.519     0.998828         1658       853.33
  102891.519     0.999023         1658      1024.00
  102891.519     0.999121         1658      1137.78
  102891.519     0.999219         1658      1280.00
  102891.519     0.999316         1658      1462.86
  102957.055     0.999414         1659      1706.67
  102957.055     1.000000         1659          inf
#[Mean    =    58601.857, StdDeviation   =    27197.825]
#[Max     =   102891.520, Total count    =         1659]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1761 requests in 2.00m, 18.06MB read
  Socket errors: connect 0, read 0, write 0, timeout 4196
Requests/sec:     14.66
Transfer/sec:    153.93KB